%有限元程序
%谢卓雨

clear
tic;

%--------------------------------------------------------------------------
%文件读入
% '3T.dat'
% fileName = input('数据文件：');
% fileName = '3T3.dat';
fileName = '../mesh/3N17x17_1x1.dat';
% npoin结点总数，nelem单元总数，nvfix约束数目，ntype问题类型，nnode单元结点数
% nmats材料数目，nhamm Hammer积分阶次，noutp结果输出控制参数,elemM单元材料号
% elemN单元结点号,nodeC结点坐标，fixN约束信息，mater材料信息，model单元模式号
% iplod载荷控制参数，lodpt集中载荷
[ npoin,nelem,nvfix,ntype,nnode,nmats,nhamm,noutp,elemM,elemN, ...
    nodeC,fixN,mater,model,iplod,lodpt ] = InputFile( fileName );
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%加载Hammer积分表格数据
%积分点位置、权重系数
[posiH,weigH] = IntHammer(nhamm);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%整体结点荷载列阵
loadP = Load(npoin,lodpt);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%计算所有可能情况（材料数）的弹性矩阵
DD = Elast(mater,ntype);%弹性矩阵，每一个单元都有可能有一个不同的弹性矩阵
%整体刚度矩阵
stifK = Stiff(npoin,nelem,nvfix,ntype,nnode,nmats,nhamm,noutp,elemM,elemN, ...
    nodeC,fixN,mater,model,iplod,lodpt,posiH,weigH,DD);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%线性代数方程求解前处理
[ loadP,stifK ] = PreLAES(loadP,stifK,fixN);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%求解线性代数方程组
%结点位移
asdis = stifK\loadP;
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%单元应力佳点，单元结点应力
[ strEP,strEN ] = Stres(asdis,DD,nelem,nhamm,elemM,elemN,nodeC,nnode,npoin);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%约束反力
fixeF = Fixed(nvfix);
%--------------------------------------------------------------------------

%--------------------------------------------------------------------------
%位移可视化
PlotDis(nodeC,asdis);
%--------------------------------------------------------------------------

time = toc;
disp(['时间：',num2str(time)])


% xiezhuoyu
% mechanics_xzy@163.com